Revit 2026 API
Wall.Create Method
Overload List
Name | Description
Create(Document, IList<Curve>, Boolean)
Create(Document, Curve, ElementId, Boolean) |  Creates a new rectangular profile wall within the project using the default wall style.
Create(Document, IList<Curve>, ElementId, ElementId, Boolean)
Create(Document, IList<Curve>, ElementId, ElementId, Boolean, XYZ)
Create(Document, Curve, ElementId, ElementId, Double, Double, Boolean, Boolean) |  Creates a new rectangular profile wall within the project using the specified wall type, height, and offset.
Top
See Also
Reference
Wall Class
Autodesk.Revit.DB Namespace